int h;

		void f(int a, int b)
		{
/*1  */	  int x, y;
/*2  */	  x = 3;
/*3  */	  y = 1;
/*4  */	  h = a;
/*5  */	  if (h < y + a)
			{
/*6  */		  if (x > 7)
				{
/*7  */			  x = 2;
				}
/*8  */		  y = 8;
			}
		  else
			{
/*9  */		  if (x < 4)
				{
/*10 */			  x = 4;
				}
/*11 */		  x = 2;
			}
/*12 */	}

//12 состояний
//Переменные: h, f_a, f_b, f_x, f_y

		void g(int a, int b)
		{
/*1  */	  int x, y;
/*2  */	  x = 3;
/*3  */	  y = 5;
/*4  */	  h = 2;
/*5  */	  if (x > 6)
			{
/*6  */		  if (h > x - a)
				{
/*7  */			  h = b;
				}
/*8  */		  x = 3;
/*9  */		  h = x - b;
			}
/*10 */	  x = 1;
/*11 */	  while (x < 7)
			{
/*12 */		  if (h > 0)
/*13 */			break;
/*14 */		  if (y < 5)
				{
/*15 */			  h = x;
				}
/*16 */		  if (h < b - x)
				{
/*17 */			  if (x < 10)
					{
/*18 */				  x = 3;
					}
/*19 */			  y = 0;
				}
			}
/*20 */	}
//20 состояний

//Переменные: g_a, g_b, g_x, g_y

//Всего переменных: 9
//Всего потенциальных состояний: 
//12 * 20 * (2 ^ (32 * 9)) = 240 * 2 ^ 288
