int h;

void f(int a, int b)
		{
/*1 */		  int x, y; 		//h = {#, 2, 3}, f_a = [-i, i], f_b = [-i, i] 
/*2 */		  x = 3;			//h = {#, 2, 3}, f_a = [-i, i], f_b = [-i, i], f_x = {#}, f_y = {#}
/*3 */		  y = 1;			//h = {#, 2, 3}, f_a = [-i, i], f_b = [-i, i], f_x = {3}, f_y = {#}
/*4 */		  h = a;			//h = {#, 2, 3}, f_a = [-i, i], f_b = [-i, i], f_x = {3}, f_y = {1}
/*5 */		  if (h < y + a)	//h = {f_a, 2, 3}, f_a = [-i, i], f_b = [-i, i], f_x = {3}, f_y = {1}
				{
							//здесь либо h не менялось,
							//либо h = 2 или 3, тогда а > 1 или 2
/*6 */			  y = 8;		//h = {f_a, 2, 3}, f_a = [-i, i], f_b = [-i, i], f_x = {3}, f_y = {1} 
				}
			else 				//h = {2, 3}, f_a = [..., 2], f_b = [-i, i], f_x = {3}, f_y = {1}
							//здесь точно h изменилось => a <= 1 (и мб 2, но не обязательно)
				{
/*7 */				 if (x < 4)	//h = {2, 3}, f_a = [..., 2], f_b = [-i, i], f_x = {3}, f_y = {1}
						{
/*8 */					  x = 4;	//h = {2, 3}, f_a = [..., 2], f_b = [-i, i], f_x = {3}, f_y = {1}
						}
/*9 */			  x = 2;		//h = {2, 3}, f_a = [..., 2], f_b = [-i, i], f_x = {4}, f_y = {1}
				}
/*10*/	}					//h = {f_a, 2, 3}, f_a = [-i, i], f_b = [-i, i], f_x = {3, 2}, f_y = {8, 1}
					//если h было равно f_a в if, то x = 3, y = 8, f_a любое
					//   или если h было равно 2 в if и f_a > 1, то x = 3, y = 8, f_a > 1  
					//   или если h было равно 3 в if и f_a > 2, то x = 3, y = 8, f_a > 2
					//если h было равно 2 в if и f_a <= 1, то x = 2, y = 1, f_a <= 1 
					//   или если h было равно 3 в if и f_a <= 2, то x = 2, y = 1, f_a <= 2 

//f может сменить h только на f_a, причём это f_a не меняется и может быть любым

void g(int a, int b)
			{
/*1 */		  int x, y;			//h = {#, f_a}, g_a = [-int, int], g_b = [-int, int]
/*2 */		  x = 3;			//h = {#, f_a}, g_a = [-int, int], g_b = [-int, int], g_x = {#}, g_y = {#}
/*3 */		  y = 5;			//h = {#, f_a}, g_a = [-int, int], g_b = [-int, int], g_x = {3}, g_y = {#}
/*4 */		  h = 2;			//h = {#, f_a}, g_a = [-int, int], g_b = [-int, int], g_x = {3}, g_y = {5}
/*5 */		  x = 1;			//h = {2, f_a}, g_a = [-int, int], g_b = [-int, int], g_x = {3}, g_y = {5}
/*6 */		  while (x < 7)		//h = {2, f_a}, g_a = [-int, int], g_b = [-int, int], g_x = {1, 3}, g_y = {5, 0}
								//(h > 0 && x == 1 && y == 5) || (h == f_a < 0 && x == 3 && y == 0)
				{
/*7 */			  if (h > 0)	//h = {2, f_a}, g_a = [-int, int], g_b = [-int, int], g_x = {1, 3}, g_y = {5, 0}
/*8 */				break;		//h = {2, f_a > 0}, g_a = [-int, int], g_b = [-int, int], g_x = {1}, g_y = {5}
/*9 */			  if (y < 5)	//h = {f_a < 0}, g_a = [-int, int], g_b = [-int, int], g_x = {1, 3}, g_y = {5, 0}
					{
/*10*/				  h = x;	//h = {f_a < 0}, g_a = [-int, int], g_b = [-int, int], g_x = {3}, g_y = {0}
					}
/*11*/			  if (h < b - x)//h = {(f_a < 0, x == 1 && f_a < g_b - 1) || (3, 3 < b - 3, x == 3)}, g_a = [-int, int], g_b = [-int, int], g_x = {1, 3}, g_y = {5, 0}
					{
/*12*/				  if (x < 10)//h = {f_a < 0 || 3}, g_a = [-int, int], g_b = [-int, int], g_x = {1, 3}, g_y = {5, 0}
						{
/*13*/					  x = 3;//h = {f_a < 0 || 3}, g_a = [-int, int], g_b = [-int, int], g_x = {1, 3}, g_y = {5, 0}
						}
/*14*/				  y = 0;	//h = {f_a < 0 || 3}, g_a = [-int, int], g_b = [-int, int], g_x = {3}, g_y = {5, 0}
					}
				}
/*15*/		}					//h = {2, 3, f_a}, g_a = [-int, int], g_b = [-int, int], g_x = {1, 3}, g_y = {5, 0}
					

//либо значение h было изменено функцией f до h > 0 на отр. и b > x + (f_a < 0) (и тогда будет два прохода и в конце h = 3), 
//либо b <= x + (f_a < 0), тогда бесконечный цикл с х == 1, y == 5, h == f_a < 0,
//либо значение h было изменено функцией f до h > 0 на пол. (и тогда будет выход по break),
//либо оно не было изменено до h > 0, тогда был выход по break с h = 2 и после этого может быть любое изменение.//g может сменить h только на g_х = 3
